export function numberToKorean(num: number) {
    const koreanNumbers = [
        "영",
        "첫", "두", "세", "네", "다섯", "여섯", "일곱", "여덟", "아홉", "열",
        "열한", "열두", "열세", "열네", "열다섯", "열여섯", "열일곱", "열여덟", "열아홉", "스무",
        "스물한", "스물두", "스물세", "스물네", "스물다섯", "스물여섯", "스물일곱", "스물여덟", "스물아홉", "서른",
        "서른한", "서른두", "서른세", "서른네", "서른다섯", "서른여섯", "서른일곱", "서른여덟", "서른아홉", "마흔",
        "마흔한", "마흔두", "마흔세", "마흔네", "마흔다섯", "마흔여섯", "마흔일곱", "마흔여덟", "마흔아홉", "쉰",
        "쉰한", "쉰두", "쉰세", "쉰네", "쉰다섯", "쉰여섯", "쉰일곱", "쉰여덟", "쉰아홉", "예순",
        "예순한", "예순두", "예순세", "예순네", "예순다섯", "예순여섯", "예순일곱", "예순여덟", "예순아홉", "일흔",
        "일흔한", "일흔두", "일흔세", "일흔네", "일흔다섯", "일흔여섯", "일흔일곱", "일흔여덟", "일흔아홉", "여든",
        "여든한", "여든두", "여든세", "여든네", "여든다섯", "여든여섯", "여든일곱", "여든여덟", "여든아홉", "아흔",
        "아흔한", "아흔두", "아흔세", "아흔네", "아흔다섯", "아흔여섯", "아흔일곱", "아흔여덟", "아흔아홉", "백"
    ];
    return `${koreanNumbers[num] || num}번째`;
};